docroot/sites/all/modules/commerce_cardsave/xml/basic.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<CardDetailsTransaction xmlns="https://www.thepaymentgateway.net/">
<PaymentMessage>
<MerchantAuthentication MerchantID="@merchant_id" Password="@password" />
<TransactionDetails Amount="@amount" CurrencyCode="@currency_code">
<MessageDetails TransactionType="@type" />
<OrderID>@order_id</OrderID>
<OrderDescription>@order_description</OrderDescription>
<TransactionControl>
<EchoCardType>TRUE</EchoCardType>
<EchoAVSCheckResult>TRUE</EchoAVSCheckResult>
<EchoCV2CheckResult>TRUE</EchoCV2CheckResult>
<EchoAmountReceived>TRUE</EchoAmountReceived>
<DuplicateDelay>20</DuplicateDelay>
<CustomVariables>
</CustomVariables>
</TransactionControl>
</TransactionDetails>
<CardDetails>
<CardName>@card_name</CardName>
<CardNumber>@card_number</CardNumber>
<StartDate Month="" Year="" />
<ExpiryDate Month="@exp_month" Year="@exp_year" />
<CV2>@cv2</CV2>
<IssueNumber>@issue_number</IssueNumber>
</CardDetails>
<CustomerDetails>
<BillingAddress>
<Address1>@address1</Address1>
<Address2>@address2</Address2>
<City>@city</City>
<State>@state</State>
<PostCode>@postcode</PostCode>
<CountryCode>@countrycode</CountryCode>
</BillingAddress>
<EmailAddress>@email</EmailAddress>
<PhoneNumber>@phone</PhoneNumber>
<CustomerIPAddress>@ip</CustomerIPAddress>
</CustomerDetails>
<PassOutData></PassOutData>
</PaymentMessage>
</CardDetailsTransaction>
</soap:Body>
</soap:Envelope>